"ktv_join" = "Join";
"ktv_score" = "Score";
"ktv_loading" = "Loading…";
"ktv_create_room" = "CREATE";
"ktv_room_title" = "Room Name";
"ktv_create_tips" = "This version allows you to broadcast for up to 20 minutes, after which the room will automatically dissolve.";
"ktv_random" = "Random";
"ktv_room_is_encryption" = "Room Password";
"ktv_room_placeHolder" = "Enter a room name to attract more audience";
"ktv_open" = "Open";
"ktv_encryption" = "Encrypted";
"ktv_please_input_4_pwd" = "Enter a 4-digit room password";
"ktv_net_status_good" = "Network Status: Good";
"ktv_net_status_m" = "Network Status: Moderate";
"ktv_net_status_low" = "Network Status: Poor";
"ktv_net_status_un_know" = "Network Status: Unknown";
"ktv_please_input_room_name" = "Please enter the room name";
"ktv_empty_search" = "No related results found";
"ktv_song_and_singer" = "%s - %s";
"ktv_please_use_headset" = "Please insert a headset to use the IER function";
"ktv_input_remote_volume" = "Please enter a positive integer between 0 and 100";
"ktv_mv" = "MV";
"ktv_song_background" = "Lyrics Background";
"ktv_more_actions" = "More Actions";
"ktv_create" = "CREATE";
"ktv_create_tips1" = "Welcome to the online Karaoke, with voice effects, synchronized lyrics, scoring, and other functions to easily recreate the offline KTV experience. Enjoy high-quality sound and make friends through music. Come and experience it together!";
"ktv_create_tips2" = "This app is for testing purposes only.";
"ktv_create_tips3" = "Each session lasts no more than 20 minutes, with up to 8 participants per room.";
"ktv_room_before_speaker" = "Click on an empty seat to join";
"ktv_room_owner" = "Host";
"ktv_room_sing1" = "Singing";
"ktv_room_sing1_1" = "Chorus";
"ktv_room_original" = "Original";
"ktv_room_change_song" = "Next";
"ktv_room_seat_off" = "Leave Seat";
"ktv_room_player_pause" = "Pause";
"ktv_room_player_play" = "Play";
"ktv_room_player_tweak" = "Adjust Sound";
"ktv_room_choose_song" = "Add";
"ktv_room_chosen_song_list" = "Added";
"ktv_room_sing2" = "Singing";
"ktv_room_no_sing" = "No one is singing now\nClick \"Add\" to show your talent";
"ktv_dialog_migu_tip" = "";
"ktv_dialog_music_list_empty" = "No related search results found";
"ktv_dialog_music_list_search_hint" = "Search Songs";
"ktv_lrc_loading" = "Preparing song...";
"ktv_lrc_load_fail" = "Loading failed";
"ktv_room_change_music_title" = "Change Song";
"ktv_room_change_music_msg" = "End the current song?";
"ktv_room_time_wait_join_chorus" = "Waiting to join chorus";
"ktv_room_time_join_chorus_" = "Mic grab countdown";
"ktv_room_time_wait" = "%02d:%02d";
"ktv_music_join_chorus" = "Join Chorus";
"ktv_music_chorus_start_now" = "Skip and solo";
"ktv_use_overtime" = "Time is up";
"ktv_need_up" = "Please take a seat first";
"ktv_error_cut" = "This song does not support vocal switching";
"ktv_join_error" = "Failed to join room";
"ktv_sync_music_error" = "Failed to synchronize song";
"ktv_leave_title" = "Close Karaoke Room";
"ktv_leave_msg" = "Closing the Karaoke room will remove all members";
"ktv_music_menu_dialog_title" = "Control Panel";
"ktv_music_menu_dialog_ear" = "In-Ear Return";
"ktv_earback_micphone_pull" = "Ear return has been turned off, please insert a headset to reopen";
"ktv_music_menu_dialog_tone" = "Adjust Pitch";
"ktv_music_menu_dialog_vol1" = "Microphone Volume";
"ktv_music_menu_dialog_remote_volume" = "Remote Volume";
"ktv_music_menu_dialog_vol2" = "Music Volume";
"ktv_lrc_level" = "Scoring Difficulty";
"ktv_use_4G" = "Use mobile network for a better experience";
"ktv_bad_wifi" = "If the Wi-Fi network is poor, the mobile network will be used to improve it";
"ktv_music_menu_dialog_effect" = "Effects";
"ktv_song_rank_1" = "Hot Songs";
"ktv_song_rank_2" = "Recommended Hits";
"ktv_song_rank_3" = "TikTok Hits";
"ktv_song_rank_4" = "Popular Ancient Songs";
"ktv_song_rank_5" = "KTV Must Sing";
"ktv_song_rank_6" = "New Songs Chart";
"ktv_song_rank_7" = "Popular New Songs";
"ktv_song_search_place_holder" = "Search Songs, Artists";
"ktv_song_effect_1" = "Spatial Effects";
"ktv_song_effect_2" = "Musical Styles";
"ktv_song_effect_3" = "Electronic Effects";
"ktv_song_effect_4" = "More Effects";
"ktv_start_electric_sound" = "Start Electronic Sound";
"ktv_select_mode" = "Select Mode";
"ktv_gentle_wind" = "Gentle Wind";
"ktv_minor" = "Minor";
"ktv_major" = "Major";
"ktv_select_starting_scale" = "Select Starting Scale";
"ktv_effect_a" = "A";
"ktv_effect_a_2" = "A#";
"ktv_effect_b" = "B";
"ktv_effect_c" = "C";
"ktv_effect_c_2" = "C#";
"ktv_effect_d" = "D";
"ktv_effect_d_2" = "D#";
"ktv_effect_e" = "E";
"ktv_effect_f" = "F";
"ktv_effect_f_2" = "F#";
"ktv_effect_g" = "G";
"ktv_effect_g_2" = "G#";
"ktv_def_nothing" = "Default None";
"ktv_room_big_man" = "Large Room (Male)";
"ktv_room_small_man" = "Small Room (Male)";
"ktv_room_big_woman" = "Large Room (Female)";
"ktv_room_small_woman" = "Small Room (Female)";
"ktv_your_score" = "Your Score";
"ktv_room_count" = "Online";
"ktv_zc" = "Lead Singer";
"ktv_hc" = "Chorus";
"ktv_song_ordering_person" = "Song Request:";
"ktv_song_ordering_person_chorus" = "Chorus:";
"ktv_people" = "People";
"ktv_music_menu_dialog_mv" = "MV";
"ktv_score_formatter" = "%@ points";
"ktv_beauty_voice" = "Beauty Voice";
"ktv_voice_effect" = "Voice Effects";
"ktv_camera" = "Camera";
"ktv_leave_chorus" = "Leave Chorus";

"ktv_toggle_mic" = "Enable or mute microphone";
"ktv_choose_cover" = "Choose your favorite song cover";
"ktv_chorus" = "Chorus";
"ktv_order_song" = "Songs";
"ktv_random_room_name" = "Generate a random room name";
"ktv_tone_down" = "Click to lower the pitch";
"ktv_tone_up" = "Click to raise the pitch";
"ktv_remote_volume_down" = "Click to lower remote volume";
"ktv_remote_volume_up" = "Click to raise remote volume";
"ktv_ok" = "OK";
"ktv_done" = "Done";
"ktv_search" = "Search";
"ktv_confirm" = "Got it";
"ktv_cancel" = "Cancel";
"ktv_error_permisstion" = "Permission required, please enable it";
"ktv_room_list_title" = "Rooms";
"ktv_room_list_empty" = "Please create a room";
"ktv_create_room_name_label" = "Room Name";
"ktv_create_room_name_label2" = "This app is for testing purposes only. Please do not use it commercially. Each session lasts no more than 10 minutes, with up to 10 participants per room.";
"ktv_create_button" = "CREATE";
"ktv_dialog_join_msg" = "Preparing, please wait…";
"ktv_permission_alert" = "Lacking necessary permissions, confirm to apply?";
"ktv_permission_refused" = "Necessary permissions not granted for this function.";
"ktv_network_unavailable" = "No available network detected, confirm to continue?";
"ktv_no_lrc" = "No lyrics available";
"ktv_content" = "Detected that the current content contains violations";
"ktv_iknow" = "Got it";
"ktv_skip_prelude" = "Skip prelude";
"ktv_skip_postlude" = "Skip postlude";
"ktv_onseat_toast" = "You need to take a seat before joining the chorus";
"ktv_load_failed_no_song" = "Song download failed, no songs available now";
"ktv_load_failed" = "Song download failed";
"ktv_try" = "Tried three times, please change song manually";
"ktv_load_failed_another_song" = "Song download failed, switched to another song";
"ktv_too_fast" = "Operation too frequent";
"ktv_lrc_failed" = "Lyrics loading failed";
"ktv_retry" = "Click to retry";
"ktv_join_chorus_failed" = "Failed to join chorus";
"ktv_enable_electronic" = "Enable Electronic Sound";
"ktv_chooseSong_failed" = "Failed to choose song, please try again";
"ktv_choose_fail" = "Too crowded, please try again later";
"ktv_audio_onmic" = "Audio on Mic";
"ktv_video_onmic" = "Video on Mic";
"ktv_room_concert" = "Concert";
"ktv_room_recording studio" = "Studio";
"ktv_room_gramophone" = "Phonograph";
"ktv_room_spacious" = "Spacious";
"ktv_room_ethereal" = "Ethereal";
"ktv_room_pop" = "Pop";
"ktv_insert_title" = "Please enter the title";
"ktv_online_ktv" = "Online KTV";
"ktv_input_pwd" = "Enter Password";
"ktv_pls_input_pwd" = "Please enter room password";
"ktv_change_song" = "Change Song";
"ktv_change_next_song" = "End the current song?";
"ktv_disband_room" = "Disband the room";
"ktv_exit_room" = "Leave the room";
"ktv_confirm_disband_room" = "Are you sure you want to disband this room?";
"ktv_confirm_exit_room" = "Are you sure you want to leave this room?";
"ktv_per_setting" = "Settings";
"ktv_per_style" = "Professional Mode";
"ktv_per_vol_quality" = "Voice Quality";
"ktv_aec_war" = "Voice quality options are only effective when AIAEC is off";
"ktv_per_ans" = "Reduce Background Noise";
"ktv_aiaec_switch" = "AIAEC Switch";
"ktv_aiaec_level" = "AIAEC";
"ktv_aiaec_rule" = "Please enter a positive integer between 0 and 4";
"ktv_perSetting" = "Settings";
"ktv_low_delay_mode" = "Low Latency Mode";
"ktv_close_aec" = "Close";
"ktv_aec_mid" = "Medium";
"ktv_aec_high" = "High";
"ktv_normal_vol" = "Standard";
"ktv_high_vol" = "High";
"ktv_mic_index" = "";
"ktv_soundcard" = "Voice AI Tuner";
"ktv_soundcard_open" = "Enable";

"ktv_effect_off" = "Origin";
"ktv_effect_concert" = "Concert";
"ktv_effect_studio" = "Studio";
"ktv_effect_phonograph" = "Phonograph";
"ktv_effect_spatial" = "Spacious";
"ktv_effect_ethereal" = "Ethereal";
"ktv_effect_pop" = "Pop";
"ktv_lrc_low" = "Low Difficulty";
"ktv_lrc_mid" = "Recommended Difficulty";
"ktv_lrc_high" = "High Difficulty";

"ktv_lrc_load_failed" = "Lyrics loading failed";
"ktv_lrc_loading" = "Preparing song...";
"ktv_retry" = "  Click to retry  ";
"ktv_leave_chorus" = "Leave";
"ktv_show_vol" = "Highlight Vocals";
"ktv_ori_sing" = "Origin";
"ktv_lead_sing" = "Lead";
"ktv_vol_setting" = "Voice Settings";

"ktv_dump" = "Audio Dump";
"ktv_export_log" = "Export Log";
"ktv_clear_dump" = "Clear Dump";
"ktv_clear_log" = "Clear Log";
"ktv_input_key" = "Please enter private param key";
"ktv_input_value" = "Please enter private param value";
"ktv_set_params" = "Set Private Params";
"ktv_debug_confirm" = "Confirm";
"ktv_ear_switch" = "In-Ear Return Switch";
"ktv_ear_setting" = "In-Ear Return Settings";
"ktv_ear_vol" = "In-Ear Return Volume";
"ktv_ear_warning" = "Enabling in-ear return allows you to hear your own voice in real-time, adjusting as you sing";
"ktv_ear_warning2" = "Due to latency and experience issues, the sound you hear in-ear return has no effects (including virtual sound card, scene shaping (KTV, concert))";
"ktv_ear_without_headset" = "Ear return requires a headset, no headset detected";

"ktv_create_room_title1" = "Moonlight Serenade";
"ktv_create_room_title2" = "Healing Harmony";
"ktv_create_room_title3" = "One Hit Wonder";
"ktv_create_room_title4" = "Got Wine";
"ktv_create_room_title5" = "Morning Melody";
"ktv_create_room_title6" = "Charming Karaoke";
"ktv_create_room_title7" = "Far and Near";
"ktv_create_room_title8" = "Windy Poems";
"ktv_create_room_title9" = "Memories of Yesteryear";
"ktv_create_room_title10" = "Eternal Melody";
"ktv_create_room_title11" = "Seventy-Two Street";
"ktv_create_room_title12" = "Poetic Emotions";
"ktv_create_room_title13" = "Simple Joy";
"ktv_create_room_title14" = "Melodic Miles";
"ktv_create_room_title15" = "Snow Dance";
"ktv_create_room_title16" = "Dream Awakening";
"ktv_create_room_title17" = "All is Well";
"ktv_create_room_title18" = "Breezy Tunes";
"ktv_create_room_title19" = "Rainy Days";
"ktv_create_room_title20" = "Clear Skies";
"ktv_create_room_title21" = "Gentle Breeze";
"ktv_create_room_title21" = "Light Breeze and Gentle Moon";
"ktv_room_exit" = "Connection timed out, the room has been dissolved";
"ktv_room_timeout" = "You have exceeded the 20-minute limit, the current room has expired, please exit and recreate the room";
"ktv_room_offline" = "The current room has expired, please exit";
"ktv_owner_leave" = "The host has disbanded the room.";
"ktv_mic_full" = "No empty seats, please try again after someone leaves";
"ktv_join_chorus_failed" = "Failed to join chorus, reason: connection lost";
"ktv_per_lose" = "Highlight Vocals feature is invalid, please reset";
"ktv_change_failed" = "Failed to change song, reason: connection lost";
"ktv_per_set_once" = "Highlight Vocals can only be set once per song, please set it again in the next song";
"ktv_load_failed_and_change" = "Failed to load song, please change song";
"ktv_onMic" = "On Mic";
"ktv_people" = "People";
"ktv_vol_gain" = "Gain Adjustment";
"ktv_vol_gain_level" = "Adjust the gain multiplier of the sound signal";
"ktv_voice_type1" = "Mature Male";
"ktv_voice_type2" = "Mature Female";
"ktv_voice_type3" = "Mature Youthful";
"ktv_voice_type4" = "Elegant Mature Female";
"ktv_voice_type5" = "Adolescent Boy";
"ktv_voice_type6" = "Mature Youthful Female";

"ktv_voice_desc1" = "High Reverb | KTV";
"ktv_voice_desc2" = "High Reverb | KTV";
"ktv_voice_desc3" = "Bright | Magnetic";
"ktv_voice_desc4" = "Bright | Magnetic";
"ktv_voice_desc5" = "Low | Warm";
"ktv_voice_desc6" = "Mellow | Full";

"ktv_pre_effect" = "Preset Effects";
"ktv_sex_kr" = "Sexy Oppa";
"ktv_sec_kr_desc" = "Melodious | Magnetic";

"ktv_effect_desc1" = "Mature Male (High Reverb | KTV)";
"ktv_effect_desc2" = "Mature Female (High Reverb | KTV)";
"ktv_effect_desc3" = "Mature Youthful (Bright | Magnetic)";
"ktv_effect_desc4" = "Elegant Mature Female (Bright | Magnetic)";
"ktv_effect_desc5" = "Adolescent Boy (Low | Warm)";
"ktv_effect_desc6" = "Mature Youthful Female (Mellow | Full)";
"ktv_open_soundCard" = "Enable Virtual Sound Card";
"ktv_mic_type" = "Microphone Type 1";
"ktv_choose_sc_params" = "Select preset parameters for the microphone";
"ktv_skip_pre" = "Skip prelude";
"ktv_skip_end" = "Skip postlude";
"ktv_per_bro" = "Professional";

"ktv_create_room_fail_toast"="Failed to create room, error:";
"ktv_join_room_fail_toast"="Failed to join room, error:";
"ktv_enter_seat_fail_toast"="Failed to join seat, error:";
"ktv_leave_seat_fail_toast"="Failed to leave seat, error:";
"ktv_kick_seat_fail_toast"="Failed to kick person off seat, error:";
"ktv_get_song_list_fail_toast"="Failed to fetch song list, error:";
"ktv_choose_song_fail_toast"="Failed to choose song, error:";
"ktv_remove_song_fail_toast"="Failed to remove song, error:";
"ktv_pin_song_fail_toast"="Failed to pin song, error:";
"ktv_switch_song_fail_toast"="Failed to change song, error:";
